## Lesson 3
# Pandas

In [49]:
# Importing Libraries
import pandas as pd
import numpy as np

In [5]:
# Basic data table in Pandas

df = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}, index=['x','y','z'])
df.head()

   A  B  C
x  1  4  7
y  2  5  8
z  3  6  9

In [7]:
# Getting just 2 rows
df.head(2)

   A  B  C
x  1  4  7
y  2  5  8

In [9]:
# Getting from bottom to top
df.tail()

   A  B  C
x  1  4  7
y  2  5  8
z  3  6  9

In [10]:
# Getting just 2 rows
df.tail(2)

   A  B  C
y  2  5  8
z  3  6  9

In [11]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [13]:
df.index.tolist()

['x', 'y', 'z']

In [14]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

In [15]:
df['A'].unique()

array([1, 2, 3])

In [16]:
df.shape

(3, 3)

In [17]:
df.size

9

In [18]:
# Reading CSV file

coffee = pd.read_csv("./assets/coffee.csv")
coffee.head(4)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [20]:
# Reading Parquet file

results = pd.read_parquet("./assets/results.parquet")
results.head(4)

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None

In [21]:
bios = pd.read_csv("./assets/bios.csv")
bios.head(4)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20

In [22]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [23]:
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
# Using loc in Pandas
coffee.loc[0]

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

In [25]:
coffee.loc[3]

Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object

In [27]:
# Using array in fetching the locs in Pandas

coffee.loc[[0,1,5]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
5  Wednesday       Latte          25

In [28]:
# Using range in loc in Pandas

coffee.loc[0:5]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25

In [30]:
# Fetching locations but rolling out some columns
coffee.loc[0:5, ["Day", "Units Sold"]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35
5  Wednesday          25

In [31]:
# Using iloc to filter columns

coffee.iloc[0:5, [0, 2]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [33]:
# Changing the index

coffee.index = coffee["Day"]
coffee.head(14)

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [35]:
# Filter the amount
coffee = pd.read_csv("./assets/coffee.csv")
coffee.loc[1, 'Units Sold'] = 10
coffee.head(3)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          10
2  Tuesday    Espresso          30

In [36]:
coffee.loc[1:3, 'Units Sold'] = 10
coffee.head(4)

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          10
2  Tuesday    Espresso          10
3  Tuesday       Latte          10

In [37]:
# Sorting base on values
coffee.sort_values(["Coffee Type", "Units Sold"])

          Day Coffee Type  Units Sold
2     Tuesday    Espresso          10
0      Monday    Espresso          25
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
1      Monday       Latte          10
3     Tuesday       Latte          10
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35

In [38]:
# Sorting base on values ascending
coffee.sort_values(["Coffee Type", "Units Sold"], ascending=[0,1])

          Day Coffee Type  Units Sold
1      Monday       Latte          10
3     Tuesday       Latte          10
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          10
0      Monday    Espresso          25
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [39]:
# Extracting data for Python
for index, row in coffee.iterrows():
    print(index, row['Coffee Type'])

0 Espresso
1 Latte
2 Espresso
3 Latte
4 Espresso
5 Latte
6 Espresso
7 Latte
8 Espresso
9 Latte
10 Espresso
11 Latte
12 Espresso
13 Latte

In [40]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [41]:
bios.tail()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [42]:
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [44]:
# Fetching the athlete born in Malaysia

bios.loc[(bios['born_country']=="MAS")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
950,954,Cheah Soon Kit,1968-01-09,Ipoh,Perak,MAS,Malaysia,180.0,73.0,NaN
952,956,Ong Ewe Hock,1972-03-14,Penang,Pulau Pinang,MAS,Malaysia,163.0,55.0,NaN
953,957,Alan Sidek Mohamed,1963-11-10,Banting,Selangor,MAS,Malaysia,178.0,69.0,NaN
954,958,Ajib Sidek Mohamed,1968-07-08,Banting,Selangor,MAS,Malaysia,180.0,68.0,NaN
958,962,Yap Kim Hock,1970-07-02,Muar,Johor,MAS,Malaysia,160.0,60.0,NaN
...,...,...,...,...,...,...,...,...,...,...
132242,135093,Welson Sim,1997-03-29,Kuching,Sarawak,MAS,Malaysia,181.0,70.0,NaN
132243,135094,Mohammad Hafifi bin Mansor,1990-10-28,Kuala Terengganu,Terengganu,MAS,Malaysia,166.0,69.0,NaN
134593,137673,Jeffrey Webb,1998-10-27,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,173.0,65.0,NaN
134594,137674,Julian Yee,1997-05-26,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,166.0,60.0,NaN
135271,138434,P. Alagendra,1929-07-23,Kajang,Selangor,MAS,Malaya,NaN,NaN,NaN

In [45]:
bios[bios['name'].str.contains('Julian', case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
113,114,Julian Robertson,1969-10-09,Peterborough,England,GBR,Great Britain,182.0,73.0,NaN
7404,7444,Julian Rossi,1942-02-12,NaN,NaN,NaN,Australia,170.0,64.0,NaN
8753,8800,Julian Wheeler,1971-04-22,Lafayette,Louisiana,USA,United States,172.0,57.0,NaN
14021,14112,Julian Dean,1975-01-28,Waihi,Waikato,NZL,New Zealand,178.0,72.0,NaN
17442,17562,Julian Pearce,1937-04-15,Jabalpur,Madhya Pradesh,IND,Australia,183.0,77.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143786,147442,Julian Venonsky,1993-10-15,NaN,NaN,NaN,United States,168.0,NaN,NaN
144191,147872,Julian Lüftner,1993-01-11,Zams,Tirol,AUT,Austria,NaN,NaN,NaN
144549,148241,Julian Jakobsen,1987-04-11,Aalborg,Nordjylland,DEN,Denmark,184.0,NaN,NaN
144732,148432,Julian Schmid,1999-09-01,Oberstdorf,Bayern,GER,Germany,NaN,NaN,NaN
145453,149178,Julian Rauchfuss,1994-09-02,Mindelheim,Bayern,GER,Germany,NaN,NaN,NaN

In [46]:
bios.query('born_country=="MAS" and born_city=="Kuala Lumpur"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11239,11298,Diana Clapham,1957-06-08,Kuala Lumpur,Kuala Lumpur,MAS,Great Britain,170.0,59.0,NaN
13291,13372,Rosman Alwi,1961-12-05,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,178.0,74.0,NaN
15743,15853,Ng Joo Pong,1946-06-19,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,167.0,64.0,NaN
17430,17550,Don Martin,1940-02-08,Kuala Lumpur,Kuala Lumpur,MAS,Australia,179.0,76.0,NaN
19421,19560,Chuah Eng Cheng,1921-01-01,Kuala Lumpur,Kuala Lumpur,MAS,Malaya,NaN,NaN,NaN
19431,19570,Avtar Singh Gill,1954-12-29,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,171.0,54.0,NaN
19452,19591,Thomas Lawrence,1929-01-01,Kuala Lumpur,Kuala Lumpur,MAS,Malaya,NaN,NaN,NaN
19456,19595,Maninderjit Singh Magmar,1972-11-17,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,180.0,78.0,NaN
19464,19603,Supaat Nadarajah,1920-01-01,Kuala Lumpur,Kuala Lumpur,MAS,Malaya,NaN,NaN,NaN
25074,25264,Frederick Nicholas,1893-07-25,Kuala Lumpur,Kuala Lumpur,MAS,Great Britain,NaN,NaN,1962-10-20
33828,34091,Kanapathy Moorthy,1932-12-23,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,177.0,75.0,2010-08-11
42951,43276,Chan Kooi Chye,1921-06-20,Kuala Lumpur,Kuala Lumpur,MAS,Malaya,159.0,53.0,NaN
42961,43286,Yap Pow Thong,1918-11-11,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,162.0,98.0,NaN
72828,73382,Rajalingam Gunaratnam,1941-12-14,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,173.0,61.0,NaN
82174,82827,Claudia Brassard-Riebesehl,1975-03-03,Kuala Lumpur,Kuala Lumpur,MAS,Canada,182.0,74.0,NaN
88555,89264,Wong Choong Hann,1977-02-17,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,183.0,71.0,NaN
89890,90609,Yeoh Ken Nee,1983-04-30,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,170.0,58.0,NaN
93386,94138,Lee Wan Yuen,1977-11-20,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,171.0,84.0,NaN
109883,111088,Ajit Singh Gill,1928-03-21,Kuala Lumpur,Kuala Lumpur,MAS,Singapore,NaN,NaN,NaN
110308,111522,Muhammad Marbawi,1983-01-30,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,168.0,89.0,NaN
110310,111524,Cheng Chu Sian,1986-03-01,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,182.0,85.0,NaN
111581,112823,Wong Mew Choo,1983-05-01,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,165.0,51.0,NaN
119732,121563,Renuga Veeran,1986-06-20,Kuala Lumpur,Kuala Lumpur,MAS,Australia,165.0,61.0,NaN
123745,125974,Ng Yan Yee,1993-07-11,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,155.0,55.0,NaN
128499,131036,Vivian Hoo,1990-03-19,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,166.0,56.0,NaN
128500,131037,Nur Dhabitah Sabri,1999-07-12,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,151.0,53.0,NaN
132233,135084,Muhammad Akmal Nor Hasrin,1995-07-15,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,180.0,74.0,NaN
132235,135086,Goh Wei Shem,1989-05-20,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,180.0,70.0,NaN
132239,135090,Danny Chia,1972-11-29,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,170.0,75.0,NaN
132240,135091,Gavin Green,1993-12-28,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,185.0,91.0,NaN
134593,137673,Jeffrey Webb,1998-10-27,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,173.0,65.0,NaN
134594,137674,Julian Yee,1997-05-26,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,166.0,60.0,NaN

In [47]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [48]:
coffee['Price'] = 25
coffee.head()

         Day Coffee Type  Units Sold  Price
0     Monday    Espresso          25     25
1     Monday       Latte          10     25
2    Tuesday    Espresso          10     25
3    Tuesday       Latte          10     25
4  Wednesday    Espresso          35     25

In [51]:
coffee['New Price'] = np.where(coffee['Coffee Type']=='Espresso', 30, 35)
coffee.head()

         Day Coffee Type  Units Sold  Price  New Price
0     Monday    Espresso          25     25         30
1     Monday       Latte          10     25         35
2    Tuesday    Espresso          10     25         30
3    Tuesday       Latte          10     25         35
4  Wednesday    Espresso          35     25         30

In [52]:
coffee.drop(columns=['Price'], inplace=True)
coffee.head()

         Day Coffee Type  Units Sold  New Price
0     Monday    Espresso          25         30
1     Monday       Latte          10         35
2    Tuesday    Espresso          10         30
3    Tuesday       Latte          10         35
4  Wednesday    Espresso          35         30

In [54]:
# Copying in Pandas
coffee_new = coffee.copy()
coffee_new.head()

         Day Coffee Type  Units Sold  New Price
0     Monday    Espresso          25         30
1     Monday       Latte          10         35
2    Tuesday    Espresso          10         30
3    Tuesday       Latte          10         35
4  Wednesday    Espresso          35         30

In [57]:
# Doing Arithmetic equation in columns

coffee_new['Revenue']=coffee_new['Units Sold']*coffee_new['New Price']
coffee_new.head()

         Day Coffee Type  Units Sold  New Price  Revenue
0     Monday    Espresso          25         30      750
1     Monday       Latte          10         35      350
2    Tuesday    Espresso          10         30      300
3    Tuesday       Latte          10         35      350
4  Wednesday    Espresso          35         30     1050

In [58]:
# Renaming the headers
coffee_new.rename(columns={"New Price":"Price"}, inplace=True)
coffee_new.head()

         Day Coffee Type  Units Sold  Price  Revenue
0     Monday    Espresso          25     30      750
1     Monday       Latte          10     35      350
2    Tuesday    Espresso          10     30      300
3    Tuesday       Latte          10     35      350
4  Wednesday    Espresso          35     30     1050

In [59]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [60]:
bn = bios.copy()
bn.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [61]:
bn['First Name']=bn['name'].str.split(' ').str[0]
bn.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,First Name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [65]:
bn.drop(columns=['First Name'], inplace=True)
bn['first_name']=bn['name'].str.split(' ').str[0]
bn.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert

In [67]:
bn.query('first_name == "Julian"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
113,114,Julian Robertson,1969-10-09,Peterborough,England,GBR,Great Britain,182.0,73.0,NaN,Julian
7404,7444,Julian Rossi,1942-02-12,NaN,NaN,NaN,Australia,170.0,64.0,NaN,Julian
8753,8800,Julian Wheeler,1971-04-22,Lafayette,Louisiana,USA,United States,172.0,57.0,NaN,Julian
14021,14112,Julian Dean,1975-01-28,Waihi,Waikato,NZL,New Zealand,178.0,72.0,NaN,Julian
17442,17562,Julian Pearce,1937-04-15,Jabalpur,Madhya Pradesh,IND,Australia,183.0,77.0,NaN,Julian
17666,17787,Julian Austin,1949-12-30,Georgetown,Demerara-Mahaica,GUY,Canada,188.0,73.0,NaN,Julian
18652,18780,Julian Halls,1967-04-17,Rochford,England,GBR,Great Britain,181.0,82.0,NaN,Julian
31190,31426,Julian Schmitz,1881-09-15,Hoboken,New Jersey,USA,United States,NaN,NaN,1943-07-05,Julian
33383,33637,Julian Davies,1971-03-16,Salisbury,England,GBR,Great Britain,173.0,66.0,NaN,Julian
44832,45174,Julian Carroll,1942-11-05,Melbourne,Victoria,AUS,Australia,188.0,80.0,NaN,Julian
49753,50111,Julian Bolling,1966-06-19,Colombo,Basnahira,SRI,Sri Lanka,177.0,70.0,NaN,Julian
53044,53419,Julian Muspratt,1958-08-26,NaN,NaN,NaN,Australia,191.0,97.0,NaN,Julian
55324,55719,Julian Creus,1917-06-30,Liverpool,England,GBR,Great Britain,NaN,NaN,1992-09-09,Julian
61019,61461,Julian Brooke-Houghton,1946-12-16,NaN,NaN,NaN,Great Britain,190.0,83.0,NaN,Julian
63023,63493,Julian Roosevelt,1924-11-14,New York,New York,USA,United States,NaN,NaN,1986-03-28,Julian
64287,64769,Julian Paynter,1970-07-15,Edinburgh,Scotland,GBR,Australia,183.0,71.0,NaN,Julian
68557,69074,Julian Golley,1971-09-12,Hammersmith,England,GBR,Great Britain,186.0,80.0,NaN,Julian
74215,74785,Julian Łukaszewicz,1904-07-16,Dnipro,Dnipropetrovsk,UKR,Poland,NaN,NaN,1982-08-03,Julian
85530,86211,Julian Green,1965-11-03,Birmingham,England,GBR,Great Britain,173.0,70.0,NaN,Julian
97789,98580,Julian Vasey,1950-04-26,Lausanne,Vaud,SUI,Great Britain,173.0,65.0,1979-05-27,Julian
102719,103676,Julian Winn,1972-09-23,Abergavenny,Wales,GBR,Great Britain,180.0,70.0,NaN,Julian
103604,104590,Julian McWatt,1978-12-27,Croydon,England,GBR,Guyana,173.0,85.0,NaN,Julian
112910,114197,Julian Real,1989-12-22,Oberhausen,Nordrhein-Westfalen,GER,Germany,198.0,100.0,NaN,Julian
115818,117185,Julian Kwit,1983-12-01,Wałbrzych,Dolnośląskie,POL,Poland,167.0,74.0,NaN,Julian
116199,117584,Julian Knowle,1974-04-29,Lauterach,Vorarlberg,AUT,Austria,189.0,72.0,NaN,Julian
121116,123083,Julian Hykes,1982-10-06,East London,Eastern Cape,RSA,South Africa,175.0,75.0,NaN,Julian
121720,123735,Julian Wruck,1991-07-06,NaN,NaN,NaN,Australia,198.0,116.0,NaN,Julian
121956,123991,Julian Justus,1988-01-29,Gießen,Hessen,GER,Germany,177.0,76.0,NaN,Julian
123599,125807,Julian Reus,1988-04-29,Hanau,Hessen,GER,Germany,176.0,76.0,NaN,Julian
130049,132702,Julian Fletcher,1990-10-08,Paget,Paget,BER,Bermuda,184.0,79.0,NaN,Julian
131075,133837,Julian Alaphilippe,1992-06-11,Saint-Amand-Montrond,Cher,FRA,France,173.0,62.0,NaN,Julian
131340,134117,Julian Flügel,1986-04-18,Fulda,Hessen,GER,Germany,183.0,64.0,NaN,Julian
131341,134118,Julian Weber,1994-08-29,Mainz,Rheinland-Pfalz,GER,Germany,191.0,98.0,NaN,Julian
131379,134163,Julian Brandt,1996-05-02,Bremen,Bremen,GER,Germany,183.0,83.0,NaN,Julian
131874,134710,Julian Walsh,1996-09-18,Kingston,Kingston,JAM,Japan,175.0,75.0,NaN,Julian
132483,135355,Julian Matthews,1988-07-21,Nelson,Nelson,NZL,New Zealand,184.0,73.0,NaN,Julian
133723,136709,Julian Eberhard,1986-11-09,Saalfelden am Steinernen Meer,Salzburg,AUT,Austria,186.0,94.0,NaN,Julian
134594,137674,Julian Yee,1997-05-26,Kuala Lumpur,Kuala Lumpur,MAS,Malaysia,166.0,60.0,NaN,Julian
136895,140131,Julian Tritscher,2003-04-30,Schladming,Steiermark,AUT,Austria,172.0,57.0,NaN,Julian
136994,140230,Julian Macaraeg,2003-05-15,NaN,NaN,NaN,Philippines,NaN,NaN,NaN,Julian
137468,140828,Julian Wilson,1988-11-08,Nambour,Queensland,AUS,Australia,NaN,NaN,NaN,Julian
140743,144262,Julian Forte,1993-01-07,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,Julian
143786,147442,Julian Venonsky,1993-10-15,NaN,NaN,NaN,United States,168.0,NaN,NaN,Julian
144191,147872,Julian Lüftner,1993-01-11,Zams,Tirol,AUT,Austria,NaN,NaN,NaN,Julian
144549,148241,Julian Jakobsen,1987-04-11,Aalborg,Nordjylland,DEN,Denmark,184.0,NaN,NaN,Julian
144732,148432,Julian Schmid,1999-09-01,Oberstdorf,Bayern,GER,Germany,NaN,NaN,NaN,Julian
145453,149178,Julian Rauchfuss,1994-09-02,Mindelheim,Bayern,GER,Germany,NaN,NaN,NaN,Julian

In [68]:
bn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [69]:
# Converting the Object to Date and Time
bn['born_date'] = pd.to_datetime(bn['born_date'])
bn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  datetime64[ns]
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(7)
memory usage: 12.2+ MB

In [70]:
# Taking out the year of birth
bn['born_year'] = bn['born_date'].dt.year
bn.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,born_year
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878.0

In [71]:
bn[['first_name', 'born_year']].head(4)

      first_name  born_year
0  Jean-François     1886.0
1         Arnaud     1969.0
2           Jean     1898.0
3        Jacques     1895.0

In [78]:
bn.to_csv('./assets/bn.csv', index=False)

In [79]:
bh = bios.copy()
bh.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [82]:
# Doing if and else statement to fetch data in Pandas using Lambda

bh['height_cat'] = bh['height_cm'].apply(lambda x:"Short" if x <170 else 'Tall')
bh[['name', 'height_cm', 'height_cat', 'weight_kg']].head()

                    name  height_cm height_cat  weight_kg
0  Jean-François Blanchy        NaN       Tall        NaN
1         Arnaud Boetsch      183.0       Tall       76.0
2           Jean Borotra      183.0       Tall       76.0
3        Jacques Brugnon      168.0      Short       64.0
4           Albert Canet        NaN       Tall        NaN

In [84]:
# Doing if and else statement to fetch data in Pandas using def

def hw_category(row):
    if row['height_cm'] < 170 and row['weight_kg']>60:
        return "Short and Chubby"
    elif row['height_cm'] < 170 and row['weight_kg']<60:
        return "Short and Skinny"
    elif row['height_cm'] > 170 and row['weight_kg']<72:
        return "Tall and Skinny"
    elif row['height_cm'] > 170 and row['weight_kg']>72:
        return "Tall and Chubby"
    else:
        return "Abnormal"

bhw = bios.copy()
bhw['category'] = bhw.apply(hw_category, axis=1)
bhw[['name', 'height_cm', 'weight_kg', 'category']].head(10)

                    name  height_cm  weight_kg          category
0  Jean-François Blanchy        NaN        NaN          Abnormal
1         Arnaud Boetsch      183.0       76.0   Tall and Chubby
2           Jean Borotra      183.0       76.0   Tall and Chubby
3        Jacques Brugnon      168.0       64.0  Short and Chubby
4           Albert Canet        NaN        NaN          Abnormal
5      Nicolas Chatelain      181.0       70.0   Tall and Skinny
6          Patrick Chila      180.0       73.0   Tall and Chubby
7           Henri Cochet        NaN        NaN          Abnormal
8          Marcel Cousin        NaN        NaN          Abnormal
9     Guy de la Chapelle        NaN        NaN          Abnormal